{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "B3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "B2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "75"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "globalW", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "37"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "globalB", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Slice_1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Slice_1/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "piecesW", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "208"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pieceB", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "373"}]}}}}, {"name": "Slice_2/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Slice_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "squareW", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "50"}]}}}}}, {"name": "squareB", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "W2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "170"}, {"size": "75"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "W3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "75"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Slice", "op": "Slice", "input": ["Placeholder", "Slice/begin", "Slice/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Slice_1", "op": "Slice", "input": ["Placeholder", "Slice_1/begin", "Slice_1/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Slice_2", "op": "Slice", "input": ["Placeholder", "Slice_2/begin", "Slice_2/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Slice", "globalW"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Slice_1", "piecesW"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "MatMul_2", "op": "MatMul", "input": ["Slice_2", "squareW"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Add", "op": "Add", "input": ["MatMul", "globalB"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_1", "op": "Add", "input": ["MatMul_1", "pieceB"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Add_2", "op": "Add", "input": ["MatMul_2", "squareB"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "concat", "op": "ConcatV2", "input": ["Add", "Add_1", "Add_2", "concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Relu6", "op": "Relu6", "input": ["concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_3", "op": "MatMul", "input": ["Relu6", "W2"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Add_3", "op": "Add", "input": ["B2", "MatMul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu6_1", "op": "Relu6", "input": ["Add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_4", "op": "MatMul", "input": ["Relu6_1", "W3"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Add_4", "op": "Add", "input": ["B3", "MatMul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output", "op": "Tanh", "input": ["Add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "B3", "shape": [1], "dtype": "float32"}, {"name": "B2", "shape": [75], "dtype": "float32"}, {"name": "Slice/begin", "shape": [2], "dtype": "int32"}, {"name": "Slice/size", "shape": [2], "dtype": "int32"}, {"name": "globalW", "shape": [37, 20], "dtype": "float32"}, {"name": "globalB", "shape": [20], "dtype": "float32"}, {"name": "Slice_1/begin", "shape": [2], "dtype": "int32"}, {"name": "Slice_1/size", "shape": [2], "dtype": "int32"}, {"name": "piecesW", "shape": [208, 100], "dtype": "float32"}, {"name": "pieceB", "shape": [100], "dtype": "float32"}, {"name": "Slice_2/begin", "shape": [2], "dtype": "int32"}, {"name": "Slice_2/size", "shape": [2], "dtype": "int32"}, {"name": "squareW", "shape": [128, 50], "dtype": "float32"}, {"name": "squareB", "shape": [50], "dtype": "float32"}, {"name": "concat/axis", "shape": [], "dtype": "int32"}, {"name": "W2", "shape": [170, 75], "dtype": "float32"}, {"name": "W3", "shape": [75, 1], "dtype": "float32"}]}]}